app/controllers/admin_controller.rb

SELECT * FROM "users" WHERE ("users"."id" = 3)
SELECT * FROM "levels" WHERE ("levels"."id" = 1)
SELECT * FROM "users"
SELECT "levels".* FROM "levels" INNER JOIN "user_levels" ON "levels".id = "user_levels".level_id WHERE (("user_levels".user_id = 1))
---
  def authorize_setting

    if request.get?
      @users = User.find(:all)
      @levels = Level.find(:all)
      @current_levels = []
    else
      user = User.find(params[:user_ids]) rescue []
      levels = Level.find(params[:levels]) rescue []

      if user.respond_to? :each
        user.each do |u|
          u.levels.replace levels
        end
      else
        user.levels.replace levels
      end

      one_user_id = user.respond_to?(:each) ? user.first.id : user.id