app/controllers/levels_controller.rb

SELECT * FROM "levels"
---
  def index
    @levels = Level.all

SELECT * FROM "levels" WHERE ("levels"."id" = 1)
---
  def show
    @level = Level.find(params[:id])

SELECT * FROM "levels" WHERE ("levels"."id" = 1)
---
  def edit
    @level = Level.find(params[:id])

INSERT INTO "levels" ("name", "created_at", "describe", "updated_at") VALUES('super admin', '2012-04-09 04:49:34', 'can do every thing', '2012-04-09 04:49:34')
---
  def create
    @level = Level.new(params[:level])

    respond_to do |format|
      if @level.save

SELECT * FROM "levels" WHERE ("levels"."id" = 2)
UPDATE "levels" SET "updated_at" = '2012-04-10 00:39:31', "describe" = 'can do admin things' WHERE "id" = 2
---
  def update
    @level = Level.find(params[:id])

    respond_to do |format|
      if @level.update_attributes(params[:level])