app/controllers/login_controller.rb

  def login
    user = User.find_by_name(params[:user_name])
---
SELECT * FROM "users" WHERE ("users"."name" = 'super admin') LIMIT 1