app/controllers/users_controller.rb

SELECT * FROM "users"
---
  def index
    @users = User.all

SELECT * FROM "users" WHERE ("users"."id" = 1)
---
  def show
    @user = User.find(params[:id])

SELECT * FROM "users" WHERE ("users"."id" = 1)
---
  def edit
    @user = User.find(params[:id])

INSERT INTO "users" ("name", "created_at", "updated_at", "sex", "password", "age", "email") VALUES('super admin', '2012-04-09 05:55:14', '2012-04-09 05:55:14', 'male', 'adzcsx', 29, 'yisuren@yahoo.com.cn')
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save

SELECT * FROM "users" WHERE ("users"."id" = 1)
---
  def update
    @user = User.find(params[:id])